<?php

return [
	'error_code' => [
		'0' => 'ok',
		'1000' => '未知错误',
		'1001' => '非法请求',
		'1002' => '接口不存在',
		'1003' => '接口地址错误',
		'1444' => '测试信息',
		'10001' => '缺少参数',
		'10002' => '参数错误',
		'10003' => '查询失败',
		'10004' => '数据不能为空',
		'10005' => '数据写入失败',
		'10006' => '数据添加失败',
		'10007' => '数据已存在',
		'10008' => '未找到要删除的数据',
		'10009' => '操作数据异常',
		'10010' => '数据未找到',
		'10011' => '校验未通过',
		'10012' => '请上传文件',
		'10013' => '文件上传失败',
		'10014' => '存在关联数据',
		'10015' => '未找到订阅者',
		'10016' => '系统初始化失败',
		'10017' => '服务器有点忙，请再试一次',
		'10018' => '数据解析失败',
		
		'10101' => '未找到事件监听者',
		
		'11001' => '请先登录',
		'11002' => '没有权限',
		'11003' => '用户名或密码错误',
		'11004' => '权限获取失败',
		'11005' => 'uid获取失败',
		'11006' => '密码修改失败',
		'11007' => '用户信息获取失败',
		'11008' => '用户信息获取异常，请重试',
		'11009' => '用户token无效',
		'11010' => '账号已被删除或禁用',
		'11011' => '找不到用户',
		'11012' => '分享用户id为空',
		'11013' => 'uid无效',
		'11014' => '未获取到openid',
		'11015' => 'RefreshToken无效',
		'11016' => '小程序登录态不存在',
		'11017' => '未知的用户类型',
		'11018' => '请先进行微信授权登录',
		'11019' => '用户已存在',
		'11020' => '账号已存在',
		'11021' => '获取数据账号不匹配',
		'11022' => '缓存写入失败',
		'11023' => '缓存读取失败',
		'11024' => 'formid不能为空',
		'11025' => '写入小程序信息失败',
		'11026' => '获取手机号失败',
		'11027' => '已绑定其他手机号',
		'11028' => '已绑定其他账号',
		
		// 分类类型
		'12001' => '分类类型id无效',
		
		// 分类
		'15001' => '分类id未找到',
		'15002' => '分类id为空',
		
		
		// 图片设置
		'80001' => '图片id未找到',
		
	],
];
